Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: o Creating a new resource that has yet to be identified by the origin server; and
zh_cn: o 创建尚未由源服务器标识的新资源；以及

source: o If the "close" connection option is present, the connection will not persist after the current response; else,
zh_cn: o 如果存在“close”连接选项，则在当前响应之后连接将不会保留；否则，

source: o If the received protocol is HTTP/1.0, the "keep-alive" connection option is present, the recipient is not a proxy, and the recipient wishes to honor the HTTP/1.0 "keep-alive" mechanism, the connection will persist after the current response; otherwise,
zh_cn: o 如果收到的协议是 HTTP/1.0，存在“keep-alive”连接选项，接收者不是代理，并且接收者希望遵守 HTTP/1.0“keep-alive”机制，连接将在之后保持目前的反应；否则，

source: o If the received protocol is HTTP/1.1 (or later), the connection will persist after the current response; else,
zh_cn: o 如果收到的协议是 HTTP/1.1(或更高版本)，则在当前响应之后连接将持久；否则，

source: o Posting a message to a bulletin board, newsgroup, mailing list, blog, or similar group of articles;
zh_cn: o 在公告栏，新闻组，消息列表，博客或类似文章组中发布消息；

source: o Providing a block of data, such as the fields entered into an HTML form, to a data-handling process;
zh_cn: o 向数据处理过程提供数据块，例如输入 HTML 表单的字段；

source: o The connection will close after the current response.
zh_cn: o 当前响应后连接将关闭。

source: of the source `Observable`?
zh_cn: 来自源 `Observable`？

source: onNext, onCompleted, and onError
zh_cn: onNext，onCompleted 和 onError

source: one Observable at a time, in the order they are emitted
zh_cn: 一个 Observable，按照它们发射的顺序

source: one at a time with a function
zh_cn: 一次一个使用函数

source: only emit an item from an Observable if a particular timespan has passed without it emitting another item
zh_cn: 从 Observable 中发射一个项目后，如果过了特定的时间而没有发射别的项目，才发送该项目（译注：防抖动）

source: only if its sequence is empty
zh_cn: 只有当它的序列为空时

source: opaque_type: The outer opaque_type field of a TLSCiphertext record is always set to the value 23 (application_data) for outward compatibility with middleboxes accustomed to parsing previous versions of TLS.
zh_cn: opaque_type：TLSCiphertext 记录的外部 opaque_type 字段始终设置为值 23(application_data)，以便与习惯于解析以前版本的 TLS 的中间件向外兼容。

source: operate upon the emissions and notifications from an Observable
zh_cn: 对观察者的发射和通知进行操作

source: or
zh_cn: 或

source: or alternatively the `TestSubscriber` instance has to be captured to gain access to its `request()` method:
zh_cn: 或者必须捕获 `TestSubscriber` 实例以获取对其 `request()` 方法的访问：

source: overload with custom `Collection` supplier.
zh_cn: 使用自定义 `Collection` 提供者重载

source: overloads with custom `Collection` supplier
zh_cn: 使用自定义 `Collection` 提供者重载

source: peer: An endpoint.
zh_cn: 对等端（peer）：一个端点。

source: periodically gather items from an Observable into bundles and emit these bundles rather than emitting the items one at a time
zh_cn: 定期将 Observable 中的项目收集到包中并发射这些包，而不是一次发送一个项目（译注：缓存）

source: periodically subdivide items from an Observable into Observable windows and emit these windows rather than emitting the items one at a time
zh_cn: 定期将 Observable 中的项目细分为 Observable 窗口并发射这些窗口，而不是一次发射一个项目

source: psk_dhe_ke: PSK with (EC)DHE key establishment.
zh_cn: psk_dhe_ke：PSK 和 (EC)DHE 密钥建立的。

source: psk_ke: PSK-only key establishment.
zh_cn: psk_ke：仅限 PSK 密钥建立。

source: queues work to begin on the current thread after any already-queued work
zh_cn: 当其它排队的任务完成后，在当前线程排队开始执行

source: random: 32 bytes generated by a secure random number generator.
zh_cn: random：由安全随机数生成器生成的 32 个字节。

source: receiver: An endpoint that is receiving records.
zh_cn: 接收者（receiver）：接收记录的端点。

source: recover from an `onError` notification by continuing the sequence without error
zh_cn: 通过继续序列而不出错来从 `onError` 通知中恢复

source: register an action to take upon a variety of Observable lifecycle events
zh_cn: 注册一个动作来承担各种 Observable 生命周期事件

source: renamed to `Flowable.doOnCancel` and `doOnDispose` for the others, [additional info](https://github.com/ReactiveX/RxJava/wiki/What's-different-in-2.0#dooncanceldoondisposeunsubscribeon)
zh_cn: 重命名为 `Flowable.doOnCancel` 和 `doOnDispose` 对于其他，[additional info](https://github.com/ReactiveX/RxJava/wiki/What's-different-in-2.0#dooncanceldoondisposeunsubscribeon)

source: renamed to `create()`
zh_cn: 重命名为 `create()`

source: renamed to `doOnComplete`, note the missing `d`!
zh_cn: 重命名为 `doOnComplete`，注意缺少的 `d`！

source: renamed to `elementAt(int, T)` and **RC3** returns `Single<T>`
zh_cn: 重命名为 `elementAt(int, T)` 且 **RC3** 返回 `Single<T>`

source: renamed to `first(T)` and **RC3** returns `Single<T>`
zh_cn: 重命名为 `first(T)` 且 **RC3** 返回 `Single<T>`

source: renamed to `hide()`, hides all identities now
zh_cn: 重命名为 `hide()`，现在隐藏所有身份

source: renamed to `last(T)` and **RC3** returns `Single<T>`
zh_cn: 重命名为 `last(T)` 且 **RC3** 返回 `Single<T>`

source: renamed to `single(T)` and **RC3** returns `Single<T>`
zh_cn: 重命名为 `single(T)` 且 **RC3** 返回 `Single<T>`

source: replaced with `generate` + overloads (distinct interfaces, you can implement them all at once)
zh_cn: 替换为 `generate` + 重载(不同的接口，您可以一次实现它们)

source: represent both the items emitted and the notifications sent as emitted items, or reverse this process
zh_cn: 表示发射的项目和作为发射项目发送的通知，或者反转此过程

source: repurposed with safe `create(FlowableOnSubscribe, BackpressureStrategy)`, raw support via `unsafeCreate()`
zh_cn: 使用安全的 `create(FlowableOnSubscribe, BackpressureStrategy)` 重新定位，通过 `unsafeCreate()` 提供原始支持

source: returns a Single that also calls a method you specify when it calls onError
zh_cn: 返回在调用 OnError 时也调用指定方法的 Single

source: returns a Single that also calls a method you specify when it calls onSuccess
zh_cn: 返回在调用 OnSuccess 时也调用指定方法的 Single

source: returns a Single that emits a specified item
zh_cn: 返回发射指定项的 Single

source: returns a Single that emits an item that is the result of a function applied to items emitted by two or more other Singles
zh_cn: 返回一个 Single，它发射一个项目，该项目是应用于两个或多个其他 Single 发射的项目的函数的结果

source: returns a Single that emits the result of a function applied to the item emitted by the source Single
zh_cn: 返回一个 Single，它发射应用于源 Single 发射的项的函数的结果

source: returns a Single that immediately notifies subscribers of an error
zh_cn: 返回一个可立即通知订阅者错误的 Single

source: returns a Single that is the result of a function applied to an item emitted by a Single
zh_cn: 返回一个 Single，它是应用于 Single 发射的项的函数的结果

source: returns a Single that makes an error notification if the source Single does not emit a value in a specified time period
zh_cn: 如果源 Single 在指定时间段内未发射值，则返回一个发射错误通知的 Single

source: returns an Observable that is the result of a function applied to an item emitted by a Single
zh_cn: 返回一个 Observable，它是应用于 Single 发射的项的函数的结果

source: schedules work to begin immediately in the current thread
zh_cn: 立即在当前线程中开始工作

source: securely-generated random bytes.
zh_cn: 安全生成的随机字节。

source: selected_group: The mutually supported group the server intends to negotiate and is requesting a retried ClientHello/KeyShare for.
zh_cn: selected_group：服务器打算协商的相互支持的组，并且正在请求重试的 ClientHello/KeyShare。

source: sender: An endpoint that is transmitting records.
zh_cn: 发送者（sender）：发送记录的端点。

source: sent by clients that receive an extended server hello containing an extension that they did not put in the corresponding client hello.
zh_cn: 由客户端发送，当它接收服务器的扩展 hello，其中包含未放入相应客户端 hello 的扩展。

source: server: The endpoint that did not initiate the TLS connection.
zh_cn: 服务器（server）：未启动 TLS 连接的端点。

source: server_share: A single KeyShareEntry value that is in the same group as one of the client's shares.
zh_cn: server_share：与客户端的一个共享位于同一组中的单个 KeyShareEntry 值。

source: shift the emissions from an Observable forward in time by a particular amount
zh_cn: 将 Observable 的发射向前转移一定量的时间

source: signature changed to `timeout(Publisher, ...)` and dropped the function, use `defer(Callable<Publisher>>)` if necessary
zh_cn: 签名改为 `timeout(Publisher, ...)` 并删除了该函数，必要时使用 `defer(Callable<Publisher>>)`

source: single items
zh_cn: 单个项目

source: so that similar items end up on the same Observable
zh_cn: 这样类似的项目最终会出现在同一个 Observable 上

source: specify the scheduler an Observable should use when it is subscribed to
zh_cn: 指定 Observable 在订阅时应使用的调度器

source: specify the scheduler on which an observer will observe this Observable
zh_cn: 指定观察者将观察此 Observable 的调度器

source: start any unstarted actions that have been scheduled for a time equal to or earlier than the present time according to the Scheduler’s clock
zh_cn: 根据调度器的时钟启动任何已安排的时间等于或早于当前时间的未启动操作

source: strategies for coping with Observables that produce items more rapidly than their observers consume them
zh_cn: 当 Observables 生产数据项比观察者消耗数据项更快时的处理策略

source: suppress duplicate items emitted by an Observable
zh_cn: 抑制 Observable 发射的重复项

source: suppress the first n items emitted by an Observable
zh_cn: 抑制 Observable 发射的前 n 项

source: suppress the last n items emitted by an Observable
zh_cn: 抑制 Observable 发射的最后 n 项

source: synchronous
zh_cn: 同步

source: that completes without emitting items
zh_cn: 完成而不发射项目

source: that does nothing at all
zh_cn: 什么都不做

source: that emits a particular item
zh_cn: 发射特定项目

source: that emits a sequence of integers
zh_cn: 发射一系列整数

source: that emits a sequence of items repeatedly
zh_cn: 重复发射一系列项目

source: that is, after a second Observable emits an item
zh_cn: 在第二个 Observable 发射一个项目之后

source: that is, after an initial period of time
zh_cn: 在最初的一段时间之后

source: that is, after the first n items
zh_cn: 前 n 项之后

source: that is, except items emitted after a second Observable emits an item
zh_cn: 除了第二个 Observable 发射项目后发射的项目

source: that is, except items emitted during a period of time before the source completes
zh_cn: 除了在源完成之前的一段时间内发射的项目

source: that is, except the last n items
zh_cn: 除了最后的 n 项

source: that is, only item n
zh_cn: 仅有项目 n

source: that is, only the first item
zh_cn: 仅第一项

source: that is, only the first items
zh_cn: 仅前几项

source: that is, only the last item
zh_cn: 仅最后一项

source: that is, only those items after the first items
zh_cn: 仅第一项之后的那些项目

source: that is, those items except the last items
zh_cn: 除了最后项之外的那些项目

source: that is, until one of those items matches a predicate
zh_cn: 直到其中一个项与谓词匹配

source: that obtains its sequence from a Future
zh_cn: 从 Future 获得序列

source: that pulls its emissions from a particular Array, Iterable, or something like that
zh_cn: 从特定的 Array，Iterable 或类似的东西中拉取其发射

source: that was returned from a function called at subscribe-time
zh_cn: 从订阅时调用的函数返回的

source: that was returned from an Action, Callable, Runnable, or something of that sort, called at subscribe-time
zh_cn: 从 Action，Callable，Runnable 或类似的东西返回，在订阅时调用

source: the ability for the producer to signal to the consumer that an error has occurred (an Iterable throws an exception if an error takes place during iteration; an Observable calls its observer’s onError method)
zh_cn: 生产者向消费者发出错误信号的能力(如果在迭代期间发生错误，则 Iterable 抛出异常；Observable 调用其观察者的 onError 方法)

source: the ability for the producer to signal to the consumer that there is no more data available (a foreach loop on an Iterable completes and returns normally in such a case; an Observable calls its observer’s onCompleted method)
zh_cn: 生产者向消费者发出信号表明没有更多可用数据的能力(Iterable 上的 foreach 循环完成并在这种情况下正常返回；Observable 调用其观察者的 onCompleted 方法)

source: the first item it emitted
zh_cn: 它发射的第一个项目

source: the last item emitted before it completed
zh_cn: 完成之前发射的最后一项

source: the server will use it when verifying the CertificateVerify message (when the client authentication is based on signing) or calculating the premaster secret (for non-ephemeral Diffie-Hellman).
zh_cn: 服务器将在验证 CertificateVerify 消息时(当客户端身份验证基于签名时)或计算预主密钥(对于非短暂的 Diffie-Hellman)时使用它。

source: the sole item it emitted
zh_cn: 它发射的唯一项目

source: therefore, a dereference should not result in a new retrieval action.
zh_cn: 因此，取消引用不应导致新的检索操作。

source: this extension SHOULD contain all groups the server supports, regardless of whether they are currently supported by the client.
zh_cn: 此扩展应该包含服务器支持的所有组，无论客户端当前是否支持它们。

source: transform the items emitted by an Observable by applying a function to each item
zh_cn: 通过将函数应用于每个项目来转换 Observable 发射的项目

source: transform the items emitted by an Observable into Observables, then flatten the emissions from those into a single Observable
zh_cn: 将 Observable 发射的项目转换为 Observables，然后将这些项目的发射变为单个 Observable（译注：扁平，一个项变为多个项，然后发出多个项(可能交错)）

source: type: The TLSPlaintext.type value containing the content type of the record.
zh_cn: type：包含记录内容类型的 TLSPlaintext.type 值。

source: type: The higher-level protocol used to process the enclosed fragment.
zh_cn: type：用于处理封闭片段的高级协议。

source: unambiguous operator should have been `defer`:
zh_cn: 因此是正确的明确的运算符应该是 `defer`：

source: until enough output has been generated.
zh_cn: 直到产生足够的输出。

source: use `Flowable.ignoreElements()`
zh_cn: 使用 `Flowable.ignoreElements()`

source: use `Flowable.single(T)`
zh_cn: 使用 `Flowable.single(T)`

source: use `Flowable.singleElement()`
zh_cn: 使用 `Flowable.singleElement()`

source: use `Observable.ignoreElements()`
zh_cn: 使用 `Observable.ignoreElements()`

source: use `Observable.single(T)`
zh_cn: 使用 `Observable.single(T)`

source: use `Observable.singleElement()`
zh_cn: 使用 `Observable.singleElement()`

source: uses the specified Executor as a Scheduler
zh_cn: 使用指定的 Executor 作为调度器

source: when an item is emitted by either of two Observables, combine the latest item emitted by each Observable via a specified function and emit items based on the results of this function
zh_cn: 当一个项目由两个 Observable 中的任何一个发射时，通过指定的函数组合每个 Observable 发射的最新项目，并根据此函数的结果发射项目

source: when it notifies observers
zh_cn: 当它通知观察者时

source: whenever any of the Observables has emitted a new item
zh_cn: 每当 Observables 的 任何 发射新项目时

source: whenever each of the Observables has emitted a new item
zh_cn: 每当 Observables 的 每个 发射一个新项目时

source: whenever an item is emitted by one Observable in a window defined by an item emitted by another
zh_cn: 每当一个 Observable 在由另一个项目发射的项目定义的窗口中发射一个项目时

source: where "+" denotes concatenation.
zh_cn: 其中“+”表示连接。

source: where + indicates concatenation.
zh_cn: 其中 + 表示连接。

source: where any two-letter primary-tag is an ISO-639 language abbreviation and any two-letter initial subtag is an ISO-3166 country code.
zh_cn: 其中任何两个字母的主要标签是 ISO-639 语言缩写，任何两个字母的初始子标签是 ISO-3166 国家代码。

source: which I can then unwrap again with
zh_cn: 我可以再解除包装

source: without such a definition, a URI is assumed to be in the same character encoding as the surrounding text.
zh_cn: 如果没有这样的定义，则假定 URI 与周围文本具有相同的字符编码。

source: would be forwarded by the final proxy as
zh_cn: 将被最终代理转发为

source: zeros: An arbitrary-length run of zero-valued bytes may appear in the cleartext after the type field.
zh_cn: zeros：类型字段后的明文中可能出现任意长度的零值字节。

source: {} Indicates messages protected using keys derived from a [sender]_handshake_traffic_secret.
zh_cn: {} 表示使用从 [sender]_handshake_traffic_secret 派生的密钥保护的消息。

source: “Hot” and “Cold” Observables
zh_cn: “Hot” 和 “Cold” Observables
